package javaexp.z02_homework.a20_kjw;

public class A1012 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
//		[1단계:개념] 1. 추상클래스와 일반클래스의 재정의 차이점을 예제를 통해 기술하세요
//		추상 클래스: abstract를 사용하는지와 abstract를 사용할때 자식격 클래스에서
//		재정의가 반드시 되어야한다.(부모라는 클래스에서 일이라는 메소드를 생성하였다. 일에는 ~일을 한다
//				라는 메소드가 작성되어있고 abstract를 통해 자식이라는 클래스에서 부모가 가진 일에 관해 말하는
//				메소드(기능)을 상속받는다. 단 기능을 끌고왔기 때문에 자식 클래스에서 반드시 관련한 재정의가 되어야한다)
//		
//		일반 클래스 : override,new를 통해 상속 및 재정의가 가능하다. 하지만 더 강한 접근제어자등을 설정할 수없다.
//		
//		hw패키지내 클래스(tiger),Animal01,A1012_normal을 예제로 생성하였습니다.
//		[1단계:개념] 2. Food를 추상클래스로 선언하고, name(음식종류), eat()공통메서드 @@을 먹다, taste()추상메서드로 다양한 맛을 출력
//				좋아하는음식 3가지를 실제클래스를 선언하여 출력하세요.
//		[1단계:개념] 3. 인터페이스의 구성요소의 특징을 예제와 함께 선언하세요
//		[1단계:확인] 4. FishingWay goFishing() 인터페이스를 선언하여, 상속받은 실제클래스를 2개를 선언하고, 실제클래스 Fisher에 이름과 인터페이스 FishingWay를 선언하고
//				addFishingSkill() 할당하게 하면  해당 어부가 낙시하는 goFishing()메서드를 호출하여 처리하세요.
//				# 조별로 파악사항(아래사항 조별로 취합 전달 17:20까지 전달)
//				1. 오늘 가장 어려웠던 부분 best3 및 내일 자세한 설명 필요한 부분
//				2. 오늘 지각(9:00기준)/수업시간 엄수(매시간:00) 인원과 사유
//				3. 수업 시간 집중하였는가?
//		        4. 내일 프로젝트 주제(사이트 확인)/코드연습병행여부 전달.
	}

}
