package javaexp.z02_homework.a06_psj;

public class A0922_X {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
//		[1단계:코드] 1. 변수명과 타입을 적절하게 선언하여 아래와 같이 선언하고 출력하세요
//		  - 이름, 나이, 키 
//		  - 좋아하는 음악명, 발매연도
//		  - 오늘 지출금액 목록과 비용, 합산
		String name;
		int age;
		double height;
		String favMusic;
		int year;
//[1단계:개념] 2. 기본 출력형식과 특수문자에 대하여 예제를 통해 기술하세요
//[1단계:개념] 3. 변수명의 선언 규칙을 예제를 통하여 기술하세요.
//[1단계:개념] 4. 기본 데이터 유형을 나열하고, 해당 데이터를 할당하여 출력하는 예제를 만드세요
//[1단계:개념] 5. 형변환이란 무엇인가 예제를 통해서 기술하세요.
//[1단계:코드] 6. 21억, 15억 데이터를 int에 할당하고, 합산결과를 변수를 선언하여 할당 출력하세요
//[1단계:개념] 7. char유형과 code값의 관계에 대하여 기술하세요.
//[1단계:코드] 8. 알파벳의 코드값 범위와 문자 0부터 9까지 범위의 코드값 범위를 확인하고 출력하세요.
//[1단계:개념] 9. 연산자, 피연산자, 연산식을 예제로 만들어, 해당 내용을 구분하여 설명하세요
//[1단계:개념] 10. 산술연산자의 종류와 그 특징을 예제를 통하여 설명하세요.
//[1단계:코드] 11. 500cc의 오렌지쥬스를 3잔에 나누어 할당할려고 한다. 소숫점 이하가 처리된 경우와
//        소숫점 이하가 처리되지 않는 경우를 나누어 코딩하세요
//[1단계:개념] 12. 증감연산식의 앞에 ++, 뒤에 ++의 차이점을 예제를 통하여 기술하세요.
//[1단계:개념] 13. 증감대입연산자의 종류를 기술하고 예제를 통하여 설명하세요. 
//[2단계:코드] 14.구매하는 김밥의 갯수를 선언하고, 1씩 증가하여 김밥의 단가(2500) 아래와 같이 출력
//			김밥 1개 구매  2500 
//			김밥 2개 구매  5000
//			김밥 3개 구매  7500
//[1단계:개념] 15. 문자열의 비교연산자 사용에서 ==, equals()의 차이점을 기술하세요.
//[1단계:개념] 16. main()의 args[]의 처리 내용방법 자바 코드를 통한 처리와 함께 기술하세요. 
//[2단계:코드] 17. args로 물건명1 가격1 갯수1 물건명2 가격2 갯수2로 입력받아 계산서(전체 총계포함)를 출력하세요.
//[1단계:개념] 18. Scanner의 처리방법을 간단한 예제와 함께 기술하세요.
//[1단계:코드] 19. Scanner객체를 활용하여 타율계산방법을 확인(검색)하고, 선수명, 타석수, 안타수를 입력 받아 해당 타자의 타율을 출력하세요.
//[1단계:개념] 20. 비교연산자의 종류를 예시와 함께 기술하세요.
//[1단계:코드] 21. Scanner를 활용하여 나이를 입력 받아 성인(18이상)여부를 출력하세요 
//[1단계:개념] 22. 논리연산자의 종류를 예제와 함께 기술하세요.
//[1단계:개념] 23. for문의 기본 구성요소를 기본 예제를 통하여 특징을 기술하세요.
//[1단계:코드] 24. for(기본) 기본 형식을 활용해서 아래 데이터를 출력하세요
//	              1) 200~300 10단위 출력, 2) 1000~950 3단위 감소, 3) 100~0까지 2로 나눈값
//[1단계:개념] 25. for문의 지역변수와 전역변수의 개념을 예제를 통해서 설명하세요
//[1단계:개념] 26. for문의 전역변수를 활용한 출력형태를 예제를 통해 설명하세요              
//[1단계:코드] 27. 입력할 과일의 3개의  과일명과 과일가격을 입력받아, 아래 형식으로 출력하되 총비용을 출력 하세요
//	                no 과일명  가격
//	                 1 사과    3000            
//	                 2 바나나   4000           
//	                 3 딸기    12000
//	                   총계    19000            
//[1단계:코드] 28. for(지역/전역) - 곰돌이가 하루 빵을 2개씩 증가해서 먹어(첫째날 2개, 둘째날 4개, 셋째날 6개 ...) 총 10일 동안 먹은 빵의 갯수를 누적하여 아래와 같이 출력하세요
//		            # 출력 형식
//		            날짜  갯수 누적
//		            1일차 2개  2개
//		            2일차 4개  6개
//		            3일차 6개 12개
//[1단계:코드] 29. for을 이용하여 100까지 4의 배수만 # 표시 및 합산,그 외는 숫자 표시, 하단에 4의 배수 합산표시.
//[2단계:코드] 30. for을 이용하여 3,6,9게임을 출력하세요(20까지)- 마지막에 3이 포함될 때 처리
//[1단계:개념] 31. 2중 for문을 기본형식을 예제를 통하여 설명하세요.
//[1단계:코드] 32. 아래 내용을 2중 for문을 활용하여
//	1) 2X2(행X열)로 ♥를 표시 2) 3X2(행X열)로 ★표시 3) 입력한 행/열로 입력한 기호표시
//[1단계:개념] 33. while문의 기본 형식을 예제를 통해 설명하세요.
//[1단계:개념] 34. while문을 이용하여 100~90까지 출력하고, 합산결과를 출력하세요.
//[1단계:코드] 35. while문을 이용해서 학생의 점수를 등록하고 총점과 평균을 출력하되, 등록을 종료시 -1를 입력해서 처리하세요.
//[1단계:개념] 36. 반복문에서 break와 continue의 차이점을 기본 예제를 통하여 기술하세요
//[1단계:개념] 37. 자바의 주요 메모리 2개의 유형에 따른 활용 내용을 기술하세요.
//[1단계:개념] 38. 배열의 구성요소를 예제를 통해서 기술하세요
//[1단계:개념] 39. 배열의 선언, 할당, 사용 형식을 여러가지 데이터 유형에 따라 구분하여 출력하세요.
//[1단계:개념] 40. 배열의 전체 데이터를 처리할 때 for문을 사용한다. 배열의 속성에 따라서 어떻게 활용되는지 예제를 통해 기술하세요.
//[1단계:코드] 41. 배열로 점수를 3개를 초기화하여, 반복문과 Scanner를 통해서 데이터를 입력되게 하고, 총계과 평균을 출력하세요.
//[1단계:개념] 42. 클래스와 객체의 차이점을 예제를 통하여 기술하세요
//[1단계:개념] 43. 필드의 특성을 예제를 통해 기술하세요
//[1단계:개념] 44. 생성자와 일반 메서드의 기능적 차이점을 기술하세요
//[1단계:개념] 45. 메서드의 여러가지 처리형태(입력,로직,리턴,복합형태)를 기술하고 간단한 예제로 구현하세요
//[1단계:개념] 46. 생성자로 데이터를 사용할 때와 메서드를 데이터를 사용할 때, 어떤 차이점이 있는지 예제로 기술하세요.
//[1단계:확인] 47. 메서드(입력+로직) 선언 예제
//1) 3개에 입력값 중에 가장 큰수 출력
//2) 1개의 입력값으로 70이상과 미만으로 합격/불합격 출력
//3) 배열로 파는 물건들을 3개의 문자열 배열로 선언하고, 입력으로 물건명으로 파는 물건 여부를 출력 표시.
//[1단계:확인] 48. 메서드(입력+로직+리턴) 선언  예제
//1) 놀이공원 클래스에서 나이를 입력해서 무료/유료 구분해서 리턴 메서드(5세미만 65이상 무료)
//2) 놀이공원 클래스에서 나이에 따라 입장료 10%, 15%, 20% 처리(나이구간 임의 적용)
//3) 배열로 등록된 회원 선언하고, 입력된 회원명에 따라 등록여부를 리턴하여 처리하세요.
//[1단계:확인] 49. 클래스(필드,생성자,메서드) 선언  예제
//1) 버스클래스로 필드(버스번호,탑승자수) 버스번호 생성자 선언, 탑승자인원수 누적메서드 리턴 현재 총탑승자수
// 탑승메서드(매개변수 탑승자인원, 리턴 현재 총탑승자수) 
//	버스번호 @@번 @@명이 탑승했습니다. 

		
		
	}

}
