package javaexp.z01_homework;

public class A1023 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	/*
[1단계:개념] 1. html태그에서 &XXX; 를 사용하는 이유는 무엇인가? 예제를 통해 설명하세요.
[1단계:확인] 2. 아래와 같이 기능버튼에 따라 출력되게, 처리하세요.
	      안녕하세요
	      공백
	      줄바꿈처리
	      ----------(사선)
	      <p></p>
	      위 명령을 클릭시마다, 화면에 위 명령내용 출력 및 처리 출력
[1단계:개념] 3. img의 속성을 기술하고, 좋아하는 풍경이미지를 동적으로 크졌다 작아졌다 변경되었다하게 처리하세요.
[1단계:확인] 4. 주사위 이미지(1~6)를 복사해서 현재 폴드에 넣고, 클릭시 마다 주사위의 번호가 바뀌게 처리하세요.
[1단계:개념] 5. 블럭태그와 인라인 태그의 차이점을 기본예제와 함께 기술하세요.


# 조별로 파악사항(아래사항 조별로 취합 전달 17:20까지 전달)
1. 오늘 가장 어려웠던 부분 best3 및 내일 자세한 설명 필요한 부분
2. 오늘 지각(9:00기준)/수업시간 엄수(매시간:00) 인원과 사유
3. 수업 시간 집중하였는가?	
	*/

	}

}
