package javaexp.z01_homework;

public class A1031 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
[1단계:확인] 1. EMP 테이블에서 emp05 복사 테이블을 생성하세요
[1단계:확인] 1. emp05 테이블에서 모든 사원의 이름, 직책, 급여를 출력합니다.
[1단계:확인] 1. emp05 테이블에서 급여가 2000 이상인 사원의 이름, 직책, 급여를 출력합니다.
[1단계:확인] 1. emp05 테이블에서 부서가 20번인 사원의 이름, 직책, 급여를 출력합니다.
[1단계:확인] 1. emp05 테이블에 새로운 사원을 추가합니다.
[1단계:확인] 1. emp05 테이블에서 사원의 이름이 "SMITH"인 사원의 정보를 수정합니다.
[1단계:확인] 1. emp05 테이블에서 사원의 이름이 "SMITH"인 사원을 삭제합니다.
[1단계:확인] 1. DEPT 테이블에서 dept03 복사 테이블을 생성하세요
[1단계:확인] 1. dept03 테이블에서 부서 번호가 20번인 부서의 정보를 수정합니다.
[1단계:확인] 1. dept03 테이블에서 모든 부서의 이름, 위치를 출력합니다.
[1단계:확인] 1. dept03 테이블에서 부서 번호가 20번인 부서를 삭제합니다.
*/
	}

}
